# Eleman İşlemleri

In [1]:
import numpy as np

In [2]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [4]:
dct ={"var1":s1,"var2":s2,"var3":s3}

In [5]:
dct

{'var1': array([5, 2, 7, 8, 0]),
 'var2': array([2, 5, 5, 1, 7]),
 'var3': array([4, 8, 7, 2, 0])}

In [8]:
import pandas as pd
df = pd.DataFrame(dct)

In [9]:
df

   var1  var2  var3
0     5     2     4
1     2     5     8
2     7     5     7
3     8     1     2
4     0     7     0

In [10]:
df[:1]

   var1  var2  var3
0     5     2     4

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.index =["a","b","c","d","e"]

In [13]:
df

   var1  var2  var3
a     5     2     4
b     2     5     8
c     7     5     7
d     8     1     2
e     0     7     0

In [14]:
df["c":"e"]

   var1  var2  var3
c     7     5     7
d     8     1     2
e     0     7     0

In [15]:
#silme işlemi

In [16]:
df.drop("a",axis=0)

   var1  var2  var3
b     2     5     8
c     7     5     7
d     8     1     2
e     0     7     0

In [18]:
df #dataframe üzerinde bir değişiklik olmadı

   var1  var2  var3
a     5     2     4
b     2     5     8
c     7     5     7
d     8     1     2
e     0     7     0

In [22]:
df.drop("b", axis=0, inplace = True) #dataframe üzerinde kalıcı değişiklik

In [23]:
df

   var1  var2  var3
c     7     5     7
d     8     1     2
e     0     7     0

In [24]:
#fancy ile silme işlemi

In [25]:
l =["c","e"]

In [26]:
df.drop(l, axis=0) #axis=0 satıra göre silme işlemi

   var1  var2  var3
d     8     1     2

In [27]:
#degiskenler icin

In [28]:
"var1" in df

True

In [29]:
l = ["var1","var4","var2"]

In [30]:
for i in l:
    print(i in df)

True
False
True

In [31]:
df

   var1  var2  var3
c     7     5     7
d     8     1     2
e     0     7     0

In [32]:
df["var4"] = df["var1"] / df["var2"]

In [33]:
df

   var1  var2  var3  var4
c     7     5     7   1.4
d     8     1     2   8.0
e     0     7     0   0.0

In [34]:
#degisken silmek

In [35]:
df.drop("var4", axis=1) #axis=1 ile sütun silinir

   var1  var2  var3
c     7     5     7
d     8     1     2
e     0     7     0

In [36]:
df.drop("var4", axis=1, inplace = True)

In [37]:
df

   var1  var2  var3
c     7     5     7
d     8     1     2
e     0     7     0

In [38]:
l = ["var1","var2"]

In [39]:
df.drop(l,axis=1)

   var3
c     7
d     2
e     0